tutorials/Terzaghi/Terzaghi/0/D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    top
    {
        type            tractionDisplacement;
        traction        uniform (0 0 0);
        pressure        uniform 100e3; //10e3/porosity
        value           uniform (0 0 0);
    }

    leftFace
    {
        type            zeroGradient;//fixedValue;
	value		uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
    	value		uniform (0 0 0);
        
    //    type            tractionDisplacement;
    //    traction        uniform (0 0 0);
    //    pressure        uniform 0;
    //    value           uniform (0 0 0);
    }

    bottom
    {
        type            tractionDisplacement;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
